OlivierC-FR/ESP32-INAV-Radar/src/main.cpp
#include <Arduino.h>
#include <esp_system.h>
#include <lib/MSP.h>
#include <lib/LoRa.h>
#include <SSD1306.h>
#include <EEPROM.h>
#include <main.h>
#include <pixel.h>
#include <math.h>
#include <cmath>

#define M_PI 3.14159265358979323846

// -------- VARS

config_t cfg;
system_t sys;
stats_t stats;
MSP msp;

msp_radar_pos_t radarPos;

curr_t curr;
peer_t peers[LORA_NODES_MAX];

air_type0_t air_0;
air_type1_t air_1;
air_type2_t air_2;
air_type3_t air_3;

air_type1_t * air_r1;
air_type2_t * air_r2;
air_type3_t * air_r3;

char host_name[3][5]={"NoFC", "iNav", "Beta"};
char host_state[2][5]={"", "ARM"};
char peer_slotname[9][3]={"X", "A", "B", "C", "D", "E", "F", "G", "H"};

SSD1306 display(0x3c, 4, 15);

// -------- EEPROM / CONFIG

void config_save() {
    for(size_t i = 0; i < sizeof(cfg); i++) {
        char data = ((char *)&cfg)[i];
        EEPROM.write(i, data);
    }
    EEPROM.commit();
}

void config_init() {

    size_t size = sizeof(cfg);
    EEPROM.begin(size * 2);

    for(size_t i = 0; i < size; i++)  {
        char data = EEPROM.read(i);
        ((char *)&cfg)[i] = data;
    }

    if (cfg.version != VERSION_CONFIG || FORCE_DEFAULT_PROFILE) { // write default config
        cfg.version = VERSION_CONFIG;
        cfg.profile_id = CFG_PROFILE_DEFAULT_ID;
        strcpy(cfg.profile_name, CFG_PROFILE_DEFAULT_NAME);

        cfg.lora_frequency = LORA_FREQUENCY;
        cfg.lora_bandwidth = LORA_BANDWIDTH;
        cfg.lora_coding_rate = LORA_CODING_RATE;
        cfg.lora_spreading_factor = LORA_SPREADING_FACTOR;
        cfg.lora_power = LORA_POWER;

        cfg.lora_nodes_max = LORA_NODES_MAX;
        cfg.lora_slot_spacing = LORA_SLOT_SPACING;
        cfg.lora_timing_delay = LORA_TIMING_DELAY;
        cfg.msp_after_tx_delay = LORA_MSP_AFTER_TX_DELAY;

        cfg.display_enable = 1;

        config_save();
    }
}

// -------- SYSTEM

int count_peers(bool active = 0) {
    int j = 0;
    for (int i = 0; i < cfg.lora_nodes_max; i++) {
        if (active == 1) {
            if ((peers[i].id > 0) && !peers[i].lost) {
                j++;
            }
        }
        else {
            if (peers[i].id > 0) {
                j++;
            }
        }
    }
    return j;
}

void reset_peers() {
    sys.now_sec = millis();
    for (int i = 0; i < cfg.lora_nodes_max; i++) {
        peers[i].id = 0;
        peers[i].host = 0;
        peers[i].state = 0;
        peers[i].lost = 0;
        peers[i].broadcast = 0;
        peers[i].lq_updated = sys.now_sec;
        peers[i].lq_tick = 0;
        peers[i].lq = 0;
        peers[i].updated = 0;
        peers[i].rssi = 0;
        peers[i].distance = 0;
        peers[i].direction = 0;
        peers[i].relalt = 0;
        strcpy(peers[i].name, "");
    }
}

void pick_id() {
    curr.id = 0;
    for (int i = 0; i < cfg.lora_nodes_max; i++) {
        if ((peers[i].id == 0) && (curr.id == 0)) {
            curr.id = i + 1;
        }
    }
}

void resync_tx_slot(int16_t delay) {
    bool startnow = 0;
    for (int i = 0; (i < cfg.lora_nodes_max) && (startnow == 0); i++) { // Resync
        if (peers[i].id > 0) {
            sys.lora_next_tx = peers[i].updated + (curr.id - peers[i].id) * cfg.lora_slot_spacing + sys.lora_cycle + delay;
            startnow = 1;
        }
    }
}

// ----------------------------------------------------------------------------- calc gps distance

double deg2rad(double deg) {
  return (deg * M_PI / 180);
}

double rad2deg(double rad) {
  return (rad * 180 / M_PI);
}

double gpsDistanceBetween(double lat1d, double lon1d, double lat2d, double lon2d) {
  double lat1r, lon1r, lat2r, lon2r, u, v;
  lat1r = deg2rad(lat1d);
  lon1r = deg2rad(lon1d);
  lat2r = deg2rad(lat2d);
  lon2r = deg2rad(lon2d);
  u = sin((lat2r - lat1r)/2);
  v = sin((lon2r - lon1r)/2);
  return 2.0 * 6371000 * asin(sqrt(u * u + cos(lat1r) * cos(lat2r) * v * v));
}


double gpsCourseTo(double lat1, double long1, double lat2, double long2)
{
  // returns course in degrees (North=0, West=270) from position 1 to position 2,
  // both specified as signed decimal-degrees latitude and longitude.
  // Because Earth is no exact sphere, calculated course may be off by a tiny fraction.
  // Courtesy of Maarten Lamers
  double dlon = radians(long2-long1);
  lat1 = radians(lat1);
  lat2 = radians(lat2);
  double a1 = sin(dlon) * cos(lat2);
  double a2 = sin(lat1) * cos(lat2) * cos(dlon);
  a2 = cos(lat1) * sin(lat2) - a2;
  a2 = atan2(a1, a2);
  if (a2 < 0.0)
  {
    a2 += TWO_PI;
  }
  return degrees(a2);
}

// -------- LoRa

void lora_send() {

    if (sys.lora_tick % 8 == 0) {

        if (sys.lora_tick % 16 == 0) {
            air_3.id = curr.id;
            air_3.type = 3;
            air_3.vbat = curr.fcanalog.vbat; // 1 to 255 (V x 10)
            air_3.mah = curr.fcanalog.mAhDrawn;
            air_3.rssi = curr.fcanalog.rssi; // 0 to 1023
            air_3.temp1 = 0;
            air_3.temp2 = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_3, sizeof(air_3));
            LoRa.endPacket(false);
        }
        else {
            air_2.id = curr.id;
            air_2.type = 2;
            air_2.host = curr.host;
            air_2.state = curr.state;
            strncpy(air_2.name, curr.name, LORA_NAME_LENGTH);
            air_2.temp1 = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_2, sizeof(air_2));
            LoRa.endPacket(false);
            }
    }
    else {
        if (sys.lora_tick % 2 == 0) {
            air_0.id = curr.id;
            air_0.type = 0;
            air_0.lat = curr.gps.lat / 100; // From XX.1234567 to XX.12345
            air_0.lon = curr.gps.lon / 100; // From XX.1234567 to XX.12345
            air_0.alt = curr.gps.alt; // m
            air_0.heading = curr.gps.groundCourse / 10;  // From degres x 10 to degres

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_0, sizeof(air_0));
            LoRa.endPacket(false);
        }
        else {
            air_1.id = curr.id;
            air_1.type = 1;
            air_1.lat = curr.gps.lat / 100; // From XX.1234567 to XX.12345
            air_1.lon = curr.gps.lon / 100; // From XX.1234567 to XX.12345
            air_1.alt = curr.gps.alt; // m
            air_1.speed = curr.gps.groundSpeed / 100; // From cm/s to m/s
            air_1.broadcast = 0;

            while (!LoRa.beginPacket()) {  }
            LoRa.write((uint8_t*)&air_1, sizeof(air_1));
            LoRa.endPacket(false);
        }
    }
}

void lora_receive(int packetSize) {

    if (packetSize == 0) return;

    sys.lora_last_rx = millis();
    sys.lora_last_rx -= (stats.last_tx_duration > 0 ) ? stats.last_tx_duration : 0; // RX time is the same as TX time

    sys.last_rssi = LoRa.packetRssi();
    sys.ppsc++;

